In [1]:
import numpy as np
import pandas as pd

## GroupBy

In [2]:
data = {
    'Category': ['A', 'B', 'A', 'B', 'A', 'B', 'A', 'B'],
    'Store': ['S1', 'S1', 'S2', 'S2', 'S1', 'S2', 'S2', 'S1'],
    'Sales': [100, 200, 150, 250, 120, 180, 200, 300],
    'Quantity': [10, 15, 12, 18, 8, 20, 15, 25],
    'Date': pd.date_range('2023-01-01', periods=8)
}
df = pd.DataFrame(data)

In [3]:
df

  Category Store  Sales  Quantity       Date
0        A    S1    100        10 2023-01-01
1        B    S1    200        15 2023-01-02
2        A    S2    150        12 2023-01-03
3        B    S2    250        18 2023-01-04
4        A    S1    120         8 2023-01-05
5        B    S2    180        20 2023-01-06
6        A    S2    200        15 2023-01-07
7        B    S1    300        25 2023-01-08

In [ ]:
# Group by Category and calculate sum of Sales
cat = df.groupby("Category") # It creates an object that cannot be seen
for i,v in cat:
    print(i)
    print(v)
print(cat)

A
  Category Store  Sales  Quantity       Date
0        A    S1    100        10 2023-01-01
2        A    S2    150        12 2023-01-03
4        A    S1    120         8 2023-01-05
6        A    S2    200        15 2023-01-07
B
  Category Store  Sales  Quantity       Date
1        B    S1    200        15 2023-01-02
3        B    S2    250        18 2023-01-04
5        B    S2    180        20 2023-01-06
7        B    S1    300        25 2023-01-08
<pandas.core.groupby.generic.DataFrameGroupBy object at 0x0000024469519950>

In [9]:
cat["Sales"].sum()

Category
A    570
B    930
Name: Sales, dtype: int64

In [10]:
df

  Category Store  Sales  Quantity       Date
0        A    S1    100        10 2023-01-01
1        B    S1    200        15 2023-01-02
2        A    S2    150        12 2023-01-03
3        B    S2    250        18 2023-01-04
4        A    S1    120         8 2023-01-05
5        B    S2    180        20 2023-01-06
6        A    S2    200        15 2023-01-07
7        B    S1    300        25 2023-01-08

In [11]:
# Group by Store and calculate sum of Sales
df.groupby("Store")["Sales"].sum()

Store
S1    720
S2    780
Name: Sales, dtype: int64

In [13]:
# GroupBy multiple columns
# GroupBy Category and Store
df.groupby(["Category","Store"])["Sales"].sum()

Category  Store
A         S1       220
          S2       350
B         S1       500
          S2       430
Name: Sales, dtype: int64

In [14]:
df.groupby(["Store","Category"])["Sales"].sum()

Store  Category
S1     A           220
       B           500
S2     A           350
       B           430
Name: Sales, dtype: int64

## Aggregation

Combining different values and get the single answer

In [16]:
df

  Category Store  Sales  Quantity       Date
0        A    S1    100        10 2023-01-01
1        B    S1    200        15 2023-01-02
2        A    S2    150        12 2023-01-03
3        B    S2    250        18 2023-01-04
4        A    S1    120         8 2023-01-05
5        B    S2    180        20 2023-01-06
6        A    S2    200        15 2023-01-07
7        B    S1    300        25 2023-01-08

In [17]:
df["Sales"].mean()

np.float64(187.5)

In [18]:
df["Sales"].median()

np.float64(190.0)

In [19]:
df["Sales"].mode()

0    200
Name: Sales, dtype: int64

In [20]:
df["Sales"].count()

np.int64(8)

In [ ]:
df["Store"].count() # It gives count of all values

np.int64(8)

In [ ]:
df["Store"].nunique() # It gives count of all unique values

2

In [23]:
df["Quantity"].min()

np.int64(8)

In [24]:
df["Quantity"].max()

np.int64(25)

In [ ]:
df["Quantity"].std() # Standard Deviation

np.float64(5.5533130394644346)

In [27]:
df["Sales"].agg(["mean","min","max","sum","count","nunique","std"])

mean        187.500000
min         100.000000
max         300.000000
sum        1500.000000
count         8.000000
nunique       7.000000
std          66.062741
Name: Sales, dtype: float64